<a href="https://colab.research.google.com/github/gtoubian/cce/blob/main/1_7_SQL_Lecture.ipynb" target="_parent"><img src="https://colab.research.google.com/assets/colab-badge.svg" alt="Open In Colab"/></a>

# SQL

[SQL](https://en.wikipedia.org/wiki/SQL) is a domain-specific language used in programming and designed for managing data held in a relational database. 


A relational database is a database that stores related information across multiple tables and allows you to query information in more than one table at the same time. 

Within a table, the data to be stored is organized in a tabular format with rows and columns. Each row inside a table represents a distinct record with the column headings specifying the corresponding type of data stored. S

There are many DB systems available like MySQL, PostgreSQL, Oracle Database (don't use this), MS SQL Server, Amazon Redshift, etc. However, all of them speak SQL, so once you've got the hang of the basic SQL syntax you'll be able to work with any of them.

To keep things simple, we will be using a database system called [SQLite](https://www.sqlite.org/about.html) to practice SQL syntax. 

Unlike most other SQL databases, SQLite does not have a separate server. SQLite reads and writes directly to ordinary files on your computer. A complete SQL database with multiple tables, etc., is contained in a single file.

### Resources

Since SQL is the main database language used worldwide, there are plenty of resources to master it:

- https://sqlzoo.net/

- https://sqlbolt.com

- leetcode.com

- https://www.sql-ex.ru/learn_exercises.php

# Using Raw SQL cursor connections

In [ ]:
import sqlite3
conn = sqlite3.connect('data/mtcars.sqlite')
c = conn.cursor()

In [ ]:
# create and execute our query
cylinders = 4
cursor = c.execute(f"SELECT * FROM results WHERE cylinders = {cylinders}")

In [ ]:
# fetch a list of the column names
column_names = list(map(lambda x: x[0], cursor.description))

print(column_names)

# fetch all rows and map column names onto them
rows = list(map(lambda x: dict(zip(column_names, x)), cursor.fetchall()))

# print the name and MPG for each result
for row in rows:
    print("{name}:\t{mpg}".format(**row))

['mpg', 'cylinders', 'displacement', 'horsepower', 'weight', 'acceleration', 'year', 'origin', 'name']
toyota corona mark ii:	24.0
datsun pl510:	27.0
volkswagen 1131 deluxe sedan:	26.0
peugeot 504:	25.0
audi 100 ls:	24.0
saab 99e:	25.0
bmw 2002:	26.0
datsun pl510:	27.0
chevrolet vega 2300:	28.0
toyota corona:	25.0
ford pinto:	25.0
chevrolet vega (sw):	22.0
mercury capri 2000:	23.0
opel 1900:	28.0
peugeot 304:	30.0
fiat 124b:	30.0
toyota corolla 1200:	31.0
datsun 1200:	35.0
volkswagen model 111:	27.0
plymouth cricket:	26.0
toyota corona hardtop:	24.0
dodge colt hardtop:	25.0
volkswagen type 3:	23.0
chevrolet vega:	20.0
ford pinto runabout:	21.0
volvo 145e (sw):	18.0
volkswagen 411 (sw):	22.0
peugeot 504 (sw):	21.0
renault 12 (sw):	26.0
ford pinto (sw):	22.0
datsun 510 (sw):	28.0
toyouta corona mark ii (sw):	23.0
dodge colt (sw):	28.0
toyota corolla 1600 (sw):	27.0
volkswagen super beetle:	26.0
toyota carina:	20.0
chevrolet vega:	21.0
datsun 610:	22.0
ford pinto:	19.0
fiat 124 sport coupe:	26.0
fiat 128:	29.0
opel manta:	24.0
audi 100ls:	20.0
volvo 144ea:	19.0
saab 99le:	24.0
datsun b210:	31.0
ford pinto:	26.0
toyota corolla 1200:	32.0
chevrolet vega:	25.0
audi fox:	29.0
volkswagen dasher:	26.0
opel manta:	26.0
toyota corona:	31.0
datsun 710:	32.0
dodge colt:	28.0
fiat 128:	24.0
fiat 124 tc:	26.0
honda civic:	24.0
subaru:	26.0
fiat x1.9:	31.0
toyota corolla:	29.0
ford pinto:	23.0
pontiac astro:	23.0
toyota corona:	24.0
volkswagen dasher:	25.0
datsun 710:	24.0
volkswagen rabbit:	29.0
audi 100ls:	23.0
peugeot 504:	23.0
volvo 244dl:	22.0
saab 99le:	25.0
honda civic cvcc:	33.0
fiat 131:	28.0
opel 1900:	25.0
capri ii:	25.0
dodge colt:	26.0
renault 12tl:	27.0
chevrolet chevette:	29.0
chevrolet woody:	24.5
vw rabbit:	29.0
honda civic:	33.0
volkswagen rabbit:	29.5
datsun b-210:	32.0
toyota corolla:	28.0
ford pinto:	26.5
volvo 245:	20.0
peugeot 504:	19.0
honda accord cvcc:	31.5
buick opel isuzu deluxe:	30.0
renault 5 gtl:	36.0
plymouth arrow gs:	25.5
datsun f-10 hatchback:	33.5
volkswagen rabbit custom:	29.0
pontiac sunbird coupe:	24.5
toyota corolla liftback:	26.0
ford mustang ii 2+2:	25.5
chevrolet chevette:	30.5
dodge colt m/m:	33.5
subaru dl:	30.0
volkswagen dasher:	30.5
bmw 320i:	21.5
volkswagen rabbit custom diesel:	43.1
ford fiesta:	36.1
mazda glc deluxe:	32.8
datsun b210 gx:	39.4
honda civic cvcc:	36.1
ford fairmont (man):	25.1
chevrolet chevette:	30.0
toyota corona:	27.5
datsun 510:	27.2
dodge omni:	30.9
toyota celica gt liftback:	21.1
plymouth sapporo:	23.2
oldsmobile starfire sx:	23.8
datsun 200-sx:	23.9
saab 99gle:	21.6
volkswagen scirocco:	31.5
honda accord lx:	29.5
ford fairmont 4:	22.3
vw rabbit custom:	31.9
maxda glc deluxe:	34.1
dodge colt hatchback custom:	35.7
amc spirit dl:	27.4
peugeot 504:	27.2
plymouth horizon:	34.2
plymouth horizon tc3:	34.5
datsun 210:	31.8
fiat strada custom:	37.3
buick skylark limited:	28.4
pontiac phoenix:	33.5
vw rabbit:	41.5
toyota corolla tercel:	38.1
chevrolet chevette:	32.1
datsun 310:	37.2
chevrolet citation:	28.0
ford fairmont:	26.4
amc concord:	24.3
audi 4000:	34.3
toyota corona liftback:	29.8
mazda 626:	31.3
datsun 510 hatchback:	37.0
toyota corolla:	32.2
mazda glc:	46.6
dodge colt:	27.9
datsun 210:	40.8
vw rabbit c (diesel):	44.3
vw dasher (diesel):	43.4
mercedes-benz 240d:	30.0
honda civic 1500 gl:	44.6
renault lecar deluxe:	40.9
subaru dl:	33.8
vokswagen rabbit:	29.8
triumph tr7 coupe:	35.0
ford mustang cobra:	23.6
honda accord:	32.4
plymouth reliant:	27.2
buick skylark:	26.6
dodge aries wagon (sw):	25.8
plymouth reliant:	30.0
toyota starlet:	39.1
plymouth champ:	39.0
honda civic 1300:	35.1
subaru:	32.3
datsun 210 mpg:	37.0
toyota tercel:	37.7
mazda glc 4:	34.1
plymouth horizon 4:	34.7
ford escort 4w:	34.4
ford escort 2h:	29.9
volkswagen jetta:	33.0
renault 18i:	34.5
honda prelude:	33.7
toyota corolla:	32.4
datsun 200sx:	32.9
mazda 626:	31.6
peugeot 505s turbo diesel:	28.1
chevrolet cavalier:	28.0
chevrolet cavalier wagon:	27.0
chevrolet cavalier 2-door:	34.0
pontiac j2000 se hatchback:	31.0
dodge aries se:	29.0
pontiac phoenix:	27.0
ford fairmont futura:	24.0
volkswagen rabbit l:	36.0
mazda glc custom l:	37.0
mazda glc custom:	31.0
plymouth horizon miser:	38.0
mercury lynx l:	36.0
nissan stanza xe:	36.0
honda accord:	36.0
toyota corolla:	34.0
honda civic:	38.0
honda civic (auto):	32.0
datsun 310 gx:	38.0
chrysler lebaron medallion:	26.0
toyota celica gt:	32.0
dodge charger 2.2:	36.0
chevrolet camaro:	27.0
ford mustang gl:	27.0
vw pickup:	44.0
dodge rampage:	32.0
ford ranger:	28.0
chevy s-10:	31.0

# Using SQL from pandas

In [ ]:
import pandas as pd
df = pd.read_sql_query("SELECT * from results", conn)
df.head()

,mpg,cylinders,displacement,horsepower,weight,acceleration,year,origin,name
0,18.0,8,307.0,130,3504.0,12.0,70,1,chevrolet chevelle malibu
1,15.0,8,350.0,165,3693.0,11.5,70,1,buick skylark 320
2,18.0,8,318.0,150,3436.0,11.0,70,1,plymouth satellite
3,16.0,8,304.0,150,3433.0,12.0,70,1,amc rebel sst
4,17.0,8,302.0,140,3449.0,10.5,70,1,ford torino

### Simple query

In [ ]:
pd.read_sql_query(
"""
SELECT  
    mpg, 
    displacement,
    name
FROM results
--- this is a SQL code comment
WHERE year > 75
    and acceleration < 18
""", 
    con=conn
)

      mpg  displacement               name
0    28.0         107.0           fiat 131
1    25.0         116.0          opel 1900
2    25.0         140.0           capri ii
3    26.0          98.0         dodge colt
4    27.0         101.0       renault 12tl
..    ...           ...                ...
165  32.0         144.0   toyota celica gt
166  36.0         135.0  dodge charger 2.2
167  27.0         151.0   chevrolet camaro
168  27.0         140.0    ford mustang gl
169  32.0         135.0      dodge rampage

[170 rows x 3 columns]

### more complex query using Groupbys

In [ ]:
pd.read_sql(
"""
SELECT  
    AVG(mpg) as avg_mpg,
    SUM(mpg) as sum_mpg,
    AVG(horsepower) as hp,
    AVG(acceleration)
FROM results
WHERE year > 75
GROUP BY cylinders
ORDER BY avg_mpg DESC
""", 
    con=conn
)

     avg_mpg  sum_mpg          hp  AVG(acceleration)
0  31.446565   4119.5   74.809160          16.551145
1  27.366667     82.1   82.333333          18.633333
2  22.600000     45.2  105.000000          13.000000
3  21.440000    964.8  103.977778          16.224444
4  17.270588    587.2  140.382353          14.144118

### Making a new table

In [ ]:
df.to_sql(
    name="test_output",
    con=conn, 
    schema=None, 
    if_exists='replace', 
    index=True, 
)

In [ ]:
### Note the LIMIT operator. It's the equivalent of df.head(10)
pd.read_sql("select * from test_output limit 10", con=conn)

,index,mpg,cylinders,displacement,horsepower,weight,acceleration,year,origin,name
0,0,18.0,8,307.0,130.0,3504.0,12.0,70,1,chevrolet chevelle malibu
1,1,15.0,8,350.0,165.0,3693.0,11.5,70,1,buick skylark 320
2,2,18.0,8,318.0,150.0,3436.0,11.0,70,1,plymouth satellite
3,3,16.0,8,304.0,150.0,3433.0,12.0,70,1,amc rebel sst
4,4,17.0,8,302.0,140.0,3449.0,10.5,70,1,ford torino
5,5,15.0,8,429.0,198.0,4341.0,10.0,70,1,ford galaxie 500
6,6,14.0,8,454.0,220.0,4354.0,9.0,70,1,chevrolet impala
7,7,14.0,8,440.0,215.0,4312.0,8.5,70,1,plymouth fury iii
8,8,14.0,8,455.0,225.0,4425.0,10.0,70,1,pontiac catalina
9,9,15.0,8,390.0,190.0,3850.0,8.5,70,1,amc ambassador dpl

In [ ]:
# pd.read_sql(
# """
# create table test_2 (
#     mpg float,
#     cylinders int,
#     displacement float,
#     horsepower float,
#     weight float,
#     acceleration float,
#     year int,
#     origin int,
#     name varchar(256)
# );
# """, con=conn)

### List  tables in a database

Table and index names can be list by doing a **SELECT** on a special table named "***SQLITE_MASTER***". Every SQLite database has an SQLITE_MASTER table that defines the schema for the database. For tables, the ***type*** field will always be '***table***' and the name field will be the name of the table. So to get a list of all tables in the database, use the following SELECT command:

See more at https://www.sqlite.org/faq.html#q7.

In [ ]:
pd.read_sql("SELECT name FROM sqlite_master WHERE type='table'", con=conn)

# Making a new DB

Is as simple as connecting to a new file name

In [ ]:
conn = sqlite3.connect('test.sqlite')

#Workshop

Today's workshop is going to be a little different. Instead of a notebook, I'd like you to follow along in this SQL Murder Mystery Game Walkthrough and find out who the killer is. This should take you through a good amount of the basic commands and should be easy to follow along with.

https://mystery.knightlab.com/walkthrough.html